Revit 2027 API
Document.ConvertSymbolicToModelCurves Method
Converts a group of SymbolicCurves to equivalent ModelCurves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelCurveArray ConvertSymbolicToModelCurves(
	View view,
	SymbolicCurveArray symbolicCurve
)
Public Function ConvertSymbolicToModelCurves (
	view As View,
	symbolicCurve As SymbolicCurveArray
) As ModelCurveArray
public:
ModelCurveArray^ ConvertSymbolicToModelCurves(
	View^ view,
	SymbolicCurveArray^ symbolicCurve
)
member ConvertSymbolicToModelCurves :
        view : View *
        symbolicCurve : SymbolicCurveArray -> ModelCurveArray
Parameters
view View
The view where the new lines will be created. The lines are projected on the view workplane. The view workplane must be parallel to the view plane.
symbolicCurve SymbolicCurveArray
 The symbolic curve array to be converted.
Return Value
ModelCurveArray
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument is null.
InvalidOperationException |  Thrown when one or more curves could not be successfully converted.
Remarks
This operation will create new ModelCurves with the symbolicCurves' geometry curves and delete the SymbolicCurve in the array.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace